Repository: fgilde/CompleXStudio
Catalog: CompleX/Properties/Resources.*.resx
Languages: de

# NoUpdateAvailable
source: There is no new Version available to Update!
de: Es existiert keine neuere Version!

source: All supported files
de: Alle Unterstützten Dateien

# WizardFinish
source: Wizard is finished
de: Assistent abgeschlossen

source: Configure Tag
de: Tag Konfigurieren

# UpdateFinished
source: Update successfully finished
de: Update wurde erfolgreich beendet

# LayoutHeader
source: Save current layout
de: Aktuelles Layout speichern

# ShowConfirmation
source: Are you sure?
de: Möchten Sie fortfahren?

# ConfigureTagDesc
source: Setup your Tag Properties here
de: Geben Sie hier Ihre Tag Informationen ein

# PleaseWait
source: Please wait until action is finished!
de: Bitte warten Sie bis die Aktion beendet ist.

# DirectoryNotExists
source: Location or Directory doesn't exists!
de: Pfad oder Verzeichnis existiert nicht!

source: &Yes
de: &Ja

source: Load Layout
de: Layout laden

# DeleteShowConfirmation
source: Are you sure you want to delete this?
de: Wirklich löschen?

source: &Close
de: &Schließen

# ExternalToolsCaption
source: External Tools...
de: Externe Anwendungen...

# EnterProjectName
source: Please enter Projectname!
de: Bitte geben Sie einen Projektnamen an!

# WariningOptionPages
source: Warning: The following Optionpages couldn't be saved!
de: Warnung: Folgende Einstellungsseiten konnten nicht gespeichert oder übernommen werden!

# ActionCanceled
source: Action was cancelled
de: Aktion wurde abgebrochen

source: Customize
de: Personalisieren

# WizardClickToFinish
source: Click "Finish" to close the wizard.
de: Klicken Sie auf "Fertigstellen" um den Assistenten zu beenden

# Extension
source: File Extension
de: Dateierweiterung

# PlugInVersionWrongException
source: Versioncheck failed
de: Versionsprüfung Fehlgeschlagen

source: Save
de: Speichern

source: Welcome
de: Willkommen

source: Errormessage
de: Fehlermeldung

# EditWith
source: Edit with {0}
de: Bearbeiten mit {0}

# Exception_EmptySettingPages
source: There is no possible Configuration
de: Es existiert keine mögliche Konfiguration

# DeleteLayoutShowConfirmation
source: Do you really want delete Layout "{0}"?
de: Sind Sie sicher, dass Sie das Layout "{0}" löschen möchten?

source: &Cancel
de: &Abbrechen

# EmptyItem
source: You need to select a Item
de: Bitte wählen Sie einen Eintrag

# WarningHeader
source: Warning
de: Warnung

# ShowConfirmationCloseSave
source: File "{0}" is not saved. Would you like to save file first?
de: Datei "{0}" wurde noch nicht gespeichert. Möchten Sie die Datei jetzt speichern?

# SelectTag
source: Please select a Tag
de: Bitte wählen Sie einen Tag

source: Options
de: Einstellungen

# ErrorToolboxEntryNameOrCategoryEmpty
source: Error: Text or Category empty!
de: Fehler: Kein Text oder keine Kategorie angegeben

source: Insert Tag
de: Tag einfügen

# SendThisError
source: Send Error via Mail?
de: Fehler per E-Mail senden?

# Exception
source: Error
de: Fehler

# Confirm_Rename
source: Are you sure, you want to rename {0} to {1}?
de: Sind Sie sicher, dass sie das Element von {0} in {1} umbenennen möchten?

# InsertParam
source: Insert Parameter
de: Parameter

source: Opening files
de: Offene Dateien

source: Object to insert
de: Objekt einfügen

# WizardFinishDetail
source: Wizard successfully finished.
de: Assistent wurde erfolgreich beendet

# DefaultFilter
source: All Files (*.*) | *.*
de: All Dateien (*.*) | *.*

# FolderName
source: Please enter a name for new folder
de: Bitte geben Sie einen Namen für den Ordner ein

# LayoutExistsReplaceShowConfirmation
source: The layout "{0}" allready exists! Would you like to replace it?
de: Das Layout "{0}" existiert bereits! Möchten Sie es ersetzen?

# Exception_GroupAllwaysExists
source: A group with the Name "{0}" allready exists!
de: Eine Gruppe mit dem Namen "{0}" existiert bereits!

# PlugInVersionWrong
source: Maybe Version of {0} is not compatible with this Version of CompleX Studio. Do you want to load PlugIn anyway?
de: Die Version von {0} ist möglicherweise nicht kompatibel mit dieser Version von CompleX Studio. Möchten Sie das Plugin trotzdem versuchen zu laden?

source: &No
de: &Nein

# RestartConfirmation
source: You should restart CompleX to apply your changes. Would you like to restart now?
de: Um die Änderungen zu übernehmen müssen Sie CompleX neu starten. Möchten Sie die Anwendung jetzt neu starten?

# AdminRightsFirstStart
source: This is your first start of CompleX Studio or update. To Update every registration you should start CompleX as Administrator
de: Sie starten CompleX Studio zum ersten mal oder haben es aktualisiert. Um alle Registrierungen zu aktualisieren, sollten Sie die Anwendung einmal als Administrator ausführen.

# AdminRightsNewPluginsInstalled
source: After your last startup of CompleX you have added or removed plugins. To Update every registration you should start CompleX as Administrator
de: Es wurden Plugins hinzugefügt oder entfernt. Um alle Registrierungen zu aktualisieren, sollten Sie die Anwendung einmal als Administrator ausführen.

# AdminRightsStartUp
source: Restart as Admin
de: Als Admin starten

# AdminRightsStartUpDescription
source: Click here to start CompleX Studio as an Administrator
de: Klicken Sie hier um die Anwendung als Administrator auszuführen.

# DontAskMeAgian
source: Don't ask me again
de: Nicht wieder fragen

source: No thank you
de: Nein Danke

source: Clear
de: Leeren

source: Filename
de: Dateiname

source: Rename
de: Umbenennen

# CopyPathToClipboard
source: Copy Path(es) to Clipboard
de: Pfad(e) in die Zwischenablage kopieren

# InsertFileContent
source: Insert File Content to active File
de: Dateiinhalt in aktive Datei einfügen

source: Open File
de: Datei öffnen

# OpenFileWithDefaultApp
source: Open with Default Application
de: Mit Standard Programm öffnen

# OpenWindowsFolder
source: Open Containing Folder(s)...
de: Verzeichnis(se) im Windows Explorer öffnen

source: Properties...
de: Eigenschaften

# ShellContextMenu
source: Show Shell Context Menu
de: Zeige Datei Kontextmenü an

source: Hide all ToolBars
de: Alle ToolBars ausblenden

source: Show all ToolBars
de: Alle ToolBars anzeigen

# CtrlRight
source: Ctrl + Right Mousebutton
de: Strg + Rechte Maustaste

# AdminHelp
source: "Help: <a href=\"http://www.nksoft.de\">What happend if I Admin restart?</a>"
de: "Hilfe: <a href=\"http://www.nksoft.de\">Was passiert wenn ich mit Adminrechten neu starte?</a>"

# ProjectFilter
source: CompleX Studio Projects (*.cspr, *.cslpr) | *.cspr;*.cslpr|CompleX Studio Project Files (*.cspr) | *.cspr|CompleX Studio Linked Project Files (*.cslpr) | *.cslpr
de: CompleX Studio Projekte (*.cspr, *.cslpr) | *.cspr;*.cslpr|CompleX Studio Projekt (*.cspr) | *.cspr|CompleX Studio Linked Projekt (*.cslpr) | *.cslpr

source: PlaceHolder
de: Platzhalter

source: Replaced Value
de: Ersetzter Wert

source: Test Placeholders
de: Platzhalter testen

source: Wizard
de: Assistent

# DsaDefaultText
source: Don't show again
de: Nicht wieder anzeigen

# FirstStartWizard
source: This is your first start of CompleX Studio. Would you like to configure recommended Settings now?
de: Sie starten CompleX Studio zum ersten Mal. Möchten Sie jetzt den Assistent starten, um die empfohlenen Einstellungen zu konfigurieren?

# EmptyItemName
source: Please enter a valid Name!
de: Bitte geben Sie einen gültigen Namen an!

# EmptyProjectName
source: Please enter a valid Projectname!
de: Bitte geben Sie einen gültigen Projektnamen an!

# ProjectExplorerAddExists
source: Could not add File {0} because a file with this Name already exists!
de: Die Datei {0} konnte nicht zum Projekt hinzugefügt werden, da eine Datei mit dem selben Namen bereits vorhanden ist!

# DeleteProjectBecauseSelected
source: You have selected the Projectnode. Are you sure, you want to delete hole Project?
de: Sie haben den Hauptknoten des Projektes markiert. Sind Sie sicher, dass Sie das ganze Projekt löschen möchten?

# AsLinkedProject
source: Create Linked Project (files will not copied)
de: Verlinktes Projekt erstellen (Datein werden nicht kopiert)

# AsLinkedProjectHint
source: Will Create a Project with linked files. If you add a file to this project, the file will not copied, and stays at the original place. Otherwise all added files will be copied to projectdir with the same structure as your Project.
de: Erstellt ein Projekt mit verlinkten Dateien. Bei diesem Projekt werden die Dateien, die zu dem Projekt hinzugefügt werden nicht in das Projektverzeichnis kopiert, sondern bleiben an ihrem originalem Standort bestehen.

# PleaseEnterName
source: please enter a name.
de: Bitte geben Sie einen Namen an.

# PleaseEnterServer
source: please enter Serveraddress or IP.
de: Bitte geben Sie eine Server,- bzw IP-Adresse an.

# ClickToChangePassword
source: Click here to change Password
de: Klicken Sie hier um das Kennwort zu ändern

source: Enter Password
de: Passwort eingeben

source: Password
de: Passwort

# PasswordWrong
source: The Password you entered is incorrect
de: Das von Ihnen eingegebene Passwort ist nicht korrekt!

# QuestionExportWithPassword
source: Would you like to export this FTP Settings with password? (If you say "Yes" for security reasons it is requered that you enter password first)
de: Möchten Sie diese FTP Einstellungen mit Password exportieren? (Bei "Ja" muss das aktuelle Passwort zur Sicherheit eingegeben werden)

# RemoveSettedPassword
source: Would you like to remove the current password?
de: Möchten Sie das aktuell gesetzte Passwort entfernen?

source: Page-ID
de: Seiten-ID

source: Manage FTP Accounts
de: FTP Zugänge verwalten

# PleaseWaitWhileUpdate
source: Please wait until upload is finished
de: Bitte warten Sie, bis der Upload beendet ist

# Upload
source: Uploading files...
de: Dateien werden hochgeladen...

# Wait
source: Please wait
de: Bitte warten

# FailedToConnect
source: Failed to Connect please check settings for this connection
de: Verbindung fehlgeschlagen, bitte überprüfen Sie die Einstellungen dieser Verbindung

# ExportDone
source: Export successfully finished!
de: Export erfolgreich beendet!

source: Export Failed
de: Export fehlgeschlagen

# AddToCurrentProject
source: Add to current Project "{0}"
de: Zum aktuellen Projekt "{0}" hinzufügen

# RemoveFromProjectConfirmation
source: Are you sure to remove all selected Items from Project?
de: Sind Sie sicher, dass Sie die Ausgewählten Elemente aus dem Projekt entfernen möchten?

# DeleteFileConfirmation
source: Are you sure you want to delete File "{0}"?
de: Sind Sie sicher, dass Sie die Datei "{0}" wirklich löschen möchten?

source: Paperbasket
de: Papierkorb

source: Delete
de: Löschen

# DeleteFileQuestion
source: Would you like to delete File "{0}"?
de: Möchten Sie die Datei "{0}" löschen?

# DeleteDsaConfirmation
source: Are you sure to delete all "Dont show again" marks?
de: Sind Sie sicher, dass Sie alle "Nicht wieder anzeigen" Markierungen löschen möchten?

# FileExists
source: File always exists
de: Datei existiert bereits

# OverwriteFile
source: File "{0}" always exists. Would you like to overwrite the existing file?
de: Datei "{0}" existiert bereits. Möchten Sie die vorhandene datei ersetzen?

source: Folder
de: Verzeichnis

source: Open
de: Öffnen

# PleaseConnectToServer
source: Please Connect first to valid server
de: Sie müssen sich zuerst mit einem Server verbinden

# AsToolWindow
source: Use this Window as Toolwindow
de: Dieses Fenster als Toolfenster

# CurrentWindowAsToolWindow
source: Convert Window "{0}" to Toolwindow
de: Aktuelles Fenster "{0}" als Toolfenster

# UploadFinished
source: Upload successfully finished
de: Upload erfolgreich beendet

source: Search
de: Suchen

# PleaseChooseEditor
source: Please choose one of more possible editors/plugins
de: Bitte wähle einen von meheren möglichen Editoren/Plugins aus

# ConfirmClearFindResults
source: New Findresults added, would you like to clear old results first?
de: Neue Suchergebnisse vorhanden, möchten Sie die alten Ergebnisse aus der Liste löschen?

# SL_AllOpenFiles
source: All Open Files
de: Alle offenen Dateien

# SL_CurrentDocument
source: Current Document
de: Aktuelle Datei

# SL_CurrentProject
source: Current Project
de: Aktuelles Projekt

# SL_OpenFIlesInProject
source: All Open Files in Current Project
de: Alle offenen Datein, aus aktuellem Projekt

# SL_Selection
source: Selection
de: Makierung

# PleaseSelectEditor
source: Pleasde Select a valid Editor
de: Bitte wähle einen gültigen, von mehreren möglichen Editoren

# SearchFilesEmpty
source: No possible Files to search
de: Es sind keine Dateien vorhanden, in denen gesucht werden kann

# SearchResultEmpty
source: No Files with given conditions found!
de: Es wurden keine Ergebnisse gefunden

source: Stay on top
de: Im Vordergrund

# SearchTextEmpty
source: Please enter Text to Search for
de: Bitte geben Sie einen Text ein, nach dem Sie suchen möchten
