<html>
<link rel="stylesheet" href="josh.css">
<body bgcolor="#FFFFFF">

		<div id="Beschreibung">
			<table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
				<tr><td valign="top" class="name">NodeList</td><td valign="top" nowrap class="compatibility">NN <span class="emphasis">6</span> IE <span class="emphasis">5</span>  DOM <span class="emphasis">1</span></td>
				</tr>
				<tr>
					<td valign="top" nowrap class="usage"><p class="literal"></p>
					</td><td valign="top" nowrap class="requirements"></td>
				</tr>
				<tr>
					<td valign="top" colspan="2" class="description"><p>Das <span class="literal">NodeList</span>-Objekt ist eine abstrakte Darstellung einer Sammlung von Nodes beliebiger Typen im W3C-DOM. Jede W3C-DOM-Eigenschaft oder -Methode, die eine Nodesammlung zur&uuml;ckgibt, gibt somit ein Objekt des Typs <span class="literal">NodeList</span> zur&uuml;ck. Die <span class="literal">childNodes</span>-Eigenschaft des <span class="literal">Node</span>-Objekts gibt beispielsweise genau wie die Methode <span class="literal">getElementsByTagName( )</span> des <span class="literal">Element</span>-Objekts ein <span class="literal">NodeList</span>-Objekt zur&uuml;ck. JavaScript legt eine <span class="literal">NodeList</span>-Sammlung als Array mit der bekannten Eigenschaft <span class="literal">length</span> offen. Die einzelnen Eintr&auml;ge des Arrays k&ouml;nnen &uuml;ber ganzzahlige Array-Indizes (in eckigen Klammern) oder &uuml;ber die Methode <span class="literal">item( )</span> des <span class="literal">NodeList</span>-Objekts in einem Skript referenziert werden.
</p>
							</td>
						</tr>
						<tr><td valign="top" colspan="2" class="CLEARSEPARATION">&#160;</td>
						</tr>
						<tr>
							<td colspan="2"><p>Manche Nodetypen verf&uuml;gen &uuml;ber eigene Sammlungen (z. B. <span class="literal">NamedNodeMap</span> f&uuml;r eine Sammlung von Attributnodes und <span class="literal">HTMLCollection</span> f&uuml;r eine Sammlung von HTML-Elementnodes). Diese anderen Sammlungsobjekte verf&uuml;gen &uuml;ber eigene Eigenschaften und Methoden, die nur f&uuml;r die in den Sammlungen enthaltenen Nodetypen von Bedeutung sind. Da beispielsweise eine Textnode (einer der einfachsten <span class="literal">Node</span>-Objekttypen) &uuml;ber keine Eigenschaft verf&uuml;gt, die einen Bezeichner enthalten kann, beinhaltet das <span class="literal">NodeList</span>-Objekt keine Methode, mit der sich ein Element anhand seiner ID referenzieren lie&szlig;e. Ein <span class="literal">HTMLCollection</span>-Objekt hingegen, das ausschlie&szlig;lich Nodes des komplexeren Typs <span class="literal">HTMLElement</span> enth&auml;lt, verf&uuml;gt &uuml;ber eine Methode namens <span class="literal">namedItem( )</span>, mit deren Hilfe ein Skript ein Element sowohl anhand seiner ID als auch anhand eines ganzzahligen Indexwerts referenzieren kann. Die Unterschiede zwischen den verschiedenen Sammlungsobjekttypen werden sofort deutlich, wenn Sie die Eigenschaften und Methoden der Sammlungsobjekte vergleichen, die Sie tats&auml;chlich in einem Skript verwenden. Lesen Sie hierzu beispielsweise die Beschreibung der Objekte <span class="literal">attributes</span> und <span class="literal">images</span> in diesem Kapitel. Auf der anderen Seite spielt die W3C-DOM-Terminologie in Skripts keine Rolle.
</p>
							</td>
						</tr>
			</table>
		</div>

</body>
</html>