<html>
<link rel="stylesheet" href="josh.css">
<body bgcolor="#FFFFFF">

		<div id="Beschreibung">
			<table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
				<tr><td valign="top" class="name">onload</td><td valign="top" nowrap class="compatibility">NN <span class="emphasis">2 </span>IE <span class="emphasis">3 </span>DOM <span class="emphasis">2</span></td>
				</tr>
				<tr>
					<td valign="top" nowrap class="usage"><p class="literal"></p>
					</td><td valign="top" nowrap class="requirements">Aufw&auml;rtsverbreitung: Nein; Abbruch m&ouml;glich: Nein</td>
				</tr>
				<tr>
					<td valign="top" colspan="2" class="description"><p>Wird ausgel&ouml;st, sobald ein externer Inhalt, der zu dem aktuellen Element oder Objekt geh&ouml;rt, geladen und initialisiert ist. Hierbei handelt es sich um die vielleicht wichtigste Ereignisbehandlungsroutine f&uuml;r das <span class="literal">window</span>-Objekt, da sie signalisiert, dass alle Inhalte des Dokuments und seiner Elemente (einschlie&szlig;lich der externen Inhalte) geladen wurden, bevor das Ereignis ausgel&ouml;st wird. Wenn dieses Ereignis ausgel&ouml;st wird, k&ouml;nnen Ihre Skripts alle Objekte innerhalb des Dokumentbaums referenzieren, ohne einen Fehler zu erzeugen.</p>
							</td>
						</tr>
						<tr><td valign="top" colspan="2" class="CLEARSEPARATION">&#160;</td>
						</tr>
						<tr>
							<td colspan="2"><p>In einem <span class="literal">frameset</span>-Element wird dieses Ereignis erst ausgel&ouml;st, nachdem die <span class="literal">onload</span>-Ereignisse f&uuml;r alle Frames ausgel&ouml;st wurden (das Ereignis wird jedoch nicht aufw&auml;rts vom Frame zum Frameset verbreitet). Beachten Sie, dass das <span class="literal">onload</span>-Ereignis, wenn der Benutzer oder ein Skript nach dem urspr&uuml;nglichen Laden des Framesets eine Seite in einen Frame l&auml;dt, f&uuml;r den Frameset nicht erneut ausgel&ouml;st wird (wohl aber f&uuml;r den Frame).</p>
							</td>
						</tr>
						<tr><td valign="top" colspan="2" class="CLEARSEPARATION">&#160;</td>
						</tr>
						<tr>
							<td colspan="2"><p>W&auml;hrend das <span class="literal">onload</span>-Ereignis f&uuml;r Formularsteuerelemente und <span class="literal">window</span>-Objekte bereits seit der Anfangszeit der skriptf&auml;higen Browser unterst&uuml;tzt wird, k&ouml;nnen moderne Browser dieses Ereignis auch in praktisch allen anderen dargestellten Elementen ausl&ouml;sen, die externe Inhalte laden.</p>
							</td>
						</tr>
				<tr>
					<td valign="top" colspan="2" class="CLEARSEPARATION">&#160;</td>
				</tr>
				<tr>
					<td valign="top" colspan="2" class="typicaltargets"><span class="title">Typische Ziele</span></td>
				</tr>
				<tr>
					<td colspan="2"><p>In allen Browsern <span class="literal">window</span>-Objekte, in Browsern ab Version 4 das <span class="literal">img</span>-Element, in IE ab Version 4 und Netscape 6 au&szlig;erdem alle dargestellten Elemente, die externe Inhalte laden k&ouml;nnen.</p>
					</td>
				</tr>
			</table>
		</div>
</body>
</html>