<html xmlns:un="http://usablenet.com/namespaces/508_rules">
   <link rel="stylesheet" href="josh.css">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Detailanzeige f&uuml;r Regel: Objekte vermeiden, die Blinken oder Flackern verursachen</title>
      <!--
  508/W3C Accessibility Suite OEM V2 for Macromedia Dreamweaver
  (C) Copyright 2001-2005 UsableNet Inc. All rights reserved.
  -->
   </head>
   <body bgcolor="#ffffff">
      <div id="Beschreibung">
         <table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
            <tr>
               <td valign="top" nowrap="true" class="name">Objekte vermeiden, die Blinken oder Flackern verursachen</td>
               <td valign="top" nowrap="true" class="compatibility">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="divider"><img src="dwres:18084" width="100%" height="1"></td>
            </tr>
            <tr>
               <td valign="top" align="right" nowrap="true" colspan="2" class="requirements">WAI / WCAG 1.0 Priorit&auml;t 2 Checkpunkt 7.2</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problembeschreibung</b><br>
                  
                           
                  <p>
                     Die Seite enth&auml;lt Objekte (Skripts, Applets oder HTML-Objekte), die auf dem Bildschirm unter Umst&auml;nden Blinken oder Flackern
                     verursachen. Die beste L&ouml;sungsm&ouml;glichkeit in diesem Fall ist, das betreffende Objekt zu &auml;ndern oder zu l&ouml;schen.
                     	 
                  </p>
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>&Uuml;berpr&uuml;fung</b>
                  
                           
                  <p>
                     &uuml;berpr&uuml;fen Sie, ob das Objekt einen Blinkeffekt verursacht (d. h. ein best&auml;ndiges Ein- und Ausschalten eines Teils der Bildschirmanzeige),
                     das vom Besucher der Website nicht unterdr&uuml;ckt werden kann.
                     	 
                  </p>
                  
                  <p>
                     Sofern dies der Fall ist, &auml;ndern Sie das Verhalten des Objekts, so dass kein Blinken mehr auftritt oder der Besucher das Blinken
                     deaktivieren kann. Eine andere M&ouml;glichkeit besteht darin, das Objekt einige Male blinken und dann ruhen zu lassen. 
                     
                  </p>
                      
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problemerkl&auml;rung</b><br>
                         
                  <p>
                     Das Objekt (Skript, Applet oder HTML-Objekt) verursacht einen Blinkeffekt, und der Benutzer des Browsers hat keine M&ouml;glichkeit,
                     dieses Verhalten zu unterdr&uuml;cken.
                     	 
                  </p>
                  
                  <p>
                     Dieses Blinkverhalten ist f&uuml;r das Auge sehr irritierend und erschwert die Konzentration auf die Inhalte der Seite bzw. auf
                     das Ausf&uuml;llen von ggf. auf der Seite enthaltenen Formularen. 
                     
                  </p>
                  
                  <p>
                     F&uuml;r Benutzer mit Sehst&ouml;rungen sind die Folgen noch schwerwiegender, da ihnen die Konzentration auf die Inhalte der Seite noch
                     weiter erschwert wird. Versetzen Sie sich in die Lage von Benutzern, die eine Bildschirmlupe einsetzen, um einen kleinen Teil
                     der Seite anzuzeigen, der sich mit dem blinkenden Text &uuml;berschneidet. In einem solchen Fall wird auch ein erheblicher Teil
                     der Ausschnittsvergr&ouml;&szlig;erung blinken, was ebenfalls die Konzentration auf die eigentliche Aufgabe erschwert.
                     
                  </p>
                  
                  <p>
                     Au&szlig;erdem sollten Sie ber&uuml;cksichtigen, dass jede Person unter Stress in gewisser Weise in der Aufnahme von Informationen behindert
                     ist. Wenn beispielsweise jemand in einem vollen und l&auml;rmerf&uuml;llten Flughafen an einem Kiosksystem ein E-Ticket f&uuml;r einen Flug
                     kaufen m&ouml;chte und eine lange Menschenschlange hinter sich wei&szlig;, die ebenfalls dieses Kiosksystem nutzen m&ouml;chte, dann wird
                     sich diese Person in aller Regel nicht vollst&auml;ndig auf ihre Aufgabe konzentrieren k&ouml;nnen. Wenn dann noch blinkende Elemente
                     auf der Seite zu sehen sind, hilft dies der betreffenden Person ganz bestimmt nicht weiter.
                     
                  </p>    
                        
               </td>
            </tr>
         </table>
      </div>
   </body>
</html>