<html xmlns:un="http://usablenet.com/namespaces/508_rules">
   <link rel="stylesheet" href="josh.css">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Detailanzeige f&uuml;r Regel: Automatische Weiterleitung von Seiten durch Markups vermeiden</title>
      <!--
  508/W3C Accessibility Suite OEM V2 for Macromedia Dreamweaver
  (C) Copyright 2001-2005 UsableNet Inc. All rights reserved.
  -->
   </head>
   <body bgcolor="#ffffff">
      <div id="Beschreibung">
         <table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
            <tr>
               <td valign="top" nowrap="true" class="name">Automatische Weiterleitung von Seiten durch Markups vermeiden</td>
               <td valign="top" nowrap="true" class="compatibility">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="divider"><img src="dwres:18084" width="100%" height="1"></td>
            </tr>
            <tr>
               <td valign="top" align="right" nowrap="true" colspan="2" class="requirements">WAI / WCAG 1.0 Priorit&auml;t 2 Checkpunkt 7.5</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problembeschreibung</b><br>
                  
                           
                  <p>
                      Wenn der Browser diese Seite l&auml;dt, wird nach einer bestimmten Zeit automatisch eine neue Seite geladen und angezeigt. Dieses
                     Verhalten sollten Sie am besten deaktivieren.
                     
                  </p>
                  
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Probleml&ouml;sung</b>
                  
                           
                  <p>
                       Solange die Browser eine Deaktivierung der automatischen Aktualisierung noch nicht zulassen, sollten Sie die Auto-Refresh-
                     bzw. Auto-Redirect-Funktion nicht nutzen.
                     
                  </p>
                  
                           
                  <p>
                       Wenn eine automatische Weiterleitung wirklich erforderlich ist, dann sollte sie mithilfe der Umleitungsfunktionen des Servers
                     implementiert werden. Au&szlig;erdem sollten die Benutzer selbst entscheiden k&ouml;nnen, wann sie die n&auml;chste Seite laden. Auf diese
                     Weise wird die Zug&auml;nglichkeit der Seiten nicht beeintr&auml;chtigt, da diese nur auf Veranlassung des Benutzers bzw. durch ein
                     gezieltes (Neu)Laden der Seite in den Browser ge&auml;ndert werden.
                     
                  </p>
                  
                           
                  <p>
                       Ist diese Option nicht m&ouml;glich und das META-Tag zur Weiterleitung einfach erforderlich, dann sollte man beide Seiten am
                     besten in beiden Richtungen mit Hyperlinks verbinden. Auf diese Weise hat der Besucher, falls die Weiterleitung zu schnell
                     erfolgt, die M&ouml;glichkeit, zur vorherigen Seite zur&uuml;ckzukehren. Wird ihm dagegen die Zeit bis zur Weiterleitung zu lang, kann
                     er nach Belieben auch auf die n&auml;chste Seite bl&auml;ttern.
                     
                  </p>
                  
                  <p>
                      Beachten Sie hierbei aber bitte, dass auch diese L&ouml;sung, wenngleich sie besser ist als die Verwendung des META-Tags zur Weiterleitung
                     allein, nicht den aktuellen Richtlinien und Checkpunkten entspricht.
                     
                  </p>
                      
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problemerkl&auml;rung</b><br>
                  
                           
                  <p>  
                       Automatisch aktualisierte Seiten k&ouml;nnen f&uuml;r Benutzer mit Behinderungen oder mit Browser-Techniken, die nicht alle normalen
                     Interaktionsmuster unterst&uuml;tzen, erhebliche Probleme verursachen.
                     
                  </p>
                  
                           
                  <p>
                       Benutzer mit Behinderungen k&ouml;nnen vor dem &auml;ndern der Seite m&ouml;glicherweise nicht schnell und genau genug den Seiteninhalt
                     und die Navigationsobjekte erfassen und bedienen. Aber auch f&uuml;r Benutzer ohne Behinderung k&ouml;nnen sich Probleme ergeben, wenn
                     sie eine Seite wegen einer sehr langsamen Internetverbindung ggf. nicht schnell genug lesen k&ouml;nnen, oder nur einen kleinen
                     Bildschirm zur Verf&uuml;gung haben, mit dem sie die Inhalte nur langsam lesen k&ouml;nnen. 
                     
                  </p>
                  
                           
                  <p>
                       Solange die Browser eine Deaktivierung der automatischen Aktualisierung noch nicht zulassen, sollten Sie die Auto-Refresh-Funktion
                     nicht nutzen.
                     
                  </p>
                  
                        
               </td>
            </tr>
         </table>
      </div>
   </body>
</html>