<html xmlns:un="http://usablenet.com/namespaces/508_rules">
   <link rel="stylesheet" href="josh.css">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Detailanzeige f&uuml;r Regel: Dokumente gegen ver&ouml;ffentlichte formale Grammatiken validieren</title>
      <!--
  508/W3C Accessibility Suite OEM V2 for Macromedia Dreamweaver
  (C) Copyright 2001-2005 UsableNet Inc. All rights reserved.
  -->
   </head>
   <body bgcolor="#ffffff">
      <div id="Beschreibung">
         <table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
            <tr>
               <td valign="top" nowrap="true" class="name">Dokumente gegen ver&ouml;ffentlichte formale Grammatiken validieren</td>
               <td valign="top" nowrap="true" class="compatibility">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="divider"><img src="dwres:18084" width="100%" height="1"></td>
            </tr>
            <tr>
               <td valign="top" align="right" nowrap="true" colspan="2" class="requirements">WAI / WCAG 1.0 Priorit&auml;t 2 Checkpunkt 3.2</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problembeschreibung</b><br>
                  
                  <p>Entsprechend der Richtlinien muss die Seite g&uuml;ltig sein.</p>
                  
                      
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>&Uuml;berpr&uuml;fung</b>
                  
                  <p>
                     Sorgen Sie also auf jeden Fall daf&uuml;r, dass Ihre Seiten g&uuml;ltigen Code enthalten. Mit dem Markup-Validator, dem XML-Validator
                     oder einem CSS-Validator k&ouml;nnen Sie die Dokumente auf Probleme &uuml;berpr&uuml;fen und entsprechende L&ouml;sungen finden.
                     
                  </p>
                  
                  
                  <p>
                     Sorgen Sie also auf jeden Fall daf&uuml;r, dass Ihre Seiten wirklich g&uuml;ltigen Code enthalten.
                     
                  </p>
                      
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problemerkl&auml;rung</b><br>
                           
                  <p>
                     Wenn Sie angemessene Codierungsstandards verwenden, k&ouml;nnen Sie Dokumente erstellen, die mit hoher Wahrscheinlichkeit (bzw.
                     letztendlich) mit allen unterschiedlichen Internet-Browsern und -Agents kompatibel sind.
                     	 
                  </p>
                  
                  
                  <p>
                     So f&uuml;hrt die Codierung von Inhalten f&uuml;r einen bestimmten Browser-Typ und eine bestimmte Version im Gegenteil unter Umst&auml;nden
                     zu Dokumenten, die f&uuml;r neu entwickelte und genutzte Versionen dieses Browsers nicht mehr lesbar sind. Au&szlig;erdem ist in diesem
                     Zusammenhang zu ber&uuml;cksichtigen, dass neben den haupts&auml;chlich verwendeten Browsern bei den Benutzern unter Umst&auml;nden auch
                     Browser mit Sprachausgabe (z. B. Home Page Reader), mit ausschlie&szlig;licher Textdarstellung (z. B. Lynx) oder Mini-Browser (z.
                     B. f&uuml;r PDAs und Mobiltelefone) verwendet werden. Aber eine Webseite kann ja nicht nur von menschlichen Besuchern angezeigt
                     werden, sie wird auch von den Crawlern der unterschiedlichen Suchmaschinen sowie von speziellen Informationen suchenden Agents
                     besucht. Auch diese Funktionen profitieren von Dokumenten, die im Einklang mit bekannten Standards entwickelt wurden.
                     
                  </p>
                  
                  
                  <p>
                     Mithilfe von Syntax-Validatoren k&ouml;nnen Sie bestimmen, ob Ihre Dokumente Fehler enthalten. Fehler, die sich in ein Dokument
                     eingeschlichen haben, k&ouml;nnen zu unerwarteten und manchmal auch unerkannten Problemen mit der Zug&auml;nglichkeit f&uuml;hren.
                     
                  </p>
                      
               </td>
            </tr>
         </table>
      </div>
   </body>
</html>