<html xmlns:un="http://usablenet.com/namespaces/508_rules">
   <link rel="stylesheet" href="josh.css">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Detailanzeige f&uuml;r Regel: Ausreichenden Kontrast zwischen Vordergrund- und Hintergrundfarben sicherstellen</title>
      <!--
  508/W3C Accessibility Suite OEM V2 for Macromedia Dreamweaver
  (C) Copyright 2001-2005 UsableNet Inc. All rights reserved.
  -->
   </head>
   <body bgcolor="#ffffff">
      <div id="Beschreibung">
         <table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
            <tr>
               <td valign="top" nowrap="true" class="name">Ausreichenden Kontrast zwischen Vordergrund- und Hintergrundfarben sicherstellen</td>
               <td valign="top" nowrap="true" class="compatibility">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="divider"><img src="dwres:18084" width="100%" height="1"></td>
            </tr>
            <tr>
               <td valign="top" align="right" nowrap="true" colspan="2" class="requirements">WAI / WCAG 1.0 Priorit&auml;t 2 Checkpunkt 2.2</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problembeschreibung</b><br>
                  
                  
                  <p>
                       Die Seite enth&auml;lt Grafiken, Objekte oder Applets. In manchen F&auml;llen kann es vorkommen, dass der Kontrast zwischen Vordergrund-
                     und Hintergrundfarbe zu gering ist und die Farben daher schlecht unterschieden werden k&ouml;nnen.
                     
                     
                  </p>
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>&Uuml;berpr&uuml;fung</b>
                  
                           
                  <p>
                       Sorgen Sie daher auf jeden Fall daf&uuml;r, dass Farben und farbige Elemente auf der Seite unter allen denkbaren Anzeigebedingungen
                     klar zu unterscheiden sind. <br> Gew&auml;hrleisten Sie den Kontrast zwischen Elementen im Vordergrund und solchen im Hintergrund also nicht nur durch Farben,
                     sondern beispielsweise auch durch unterschiedliche Helligkeit, Formate sowie Schriftgr&ouml;&szlig;en oder Schriftarten.
                     
                  </p>
                  
                           
                  <p>
                       Wenn Sie Farben verwenden, sollten Sie den Unterschied zwischen Vordergrund- und Hintergrundfarbe mithilfe der folgenden
                     drei Charakteristika hervorheben:
                     
                  </p>
                  
                           
                  <ul>
                     
                                 
                     <li>
                                       <strong>Farbton</strong>
                                    
                     </li>
                     
                                 
                     <li>
                                       <strong>S&auml;ttigung</strong>
                                    
                     </li>
                     
                                 
                     <li>
                                       <strong>Helligkeit</strong>
                                    
                     </li>
                     
                              
                  </ul>
                  
                           
                  <p>
                       Die folgenden Schritte sind einfache Testm&ouml;glichkeiten f&uuml;r eine Seite:
                     
                  </p>
                  
                           
                  <ul>
                                 
                     <li> Zeigen Sie die Seite auf einem Schwarzwei&szlig;bildschirm an. &uuml;berpr&uuml;fen Sie dabei alle Elemente auf der Seite.</li>
                                 
                     <li> Drucken Sie die Seite auf einem Schwarzwei&szlig;drucker.</li>
                                 
                     <li> Kopieren Sie den Druck mehrere Male und &uuml;berpr&uuml;fen Sie den Qualit&auml;tsverlust. Auf diese Weise wird deutlich, welche Elemente
                        noch st&auml;rker hervorgehoben werden m&uuml;ssen (z. B. durch Unterstreichen der Hyperlinks) bzw. welche der Hervorhebungen zu undeutlich
                        oder zu klein sind.
                     </li>
                              
                  </ul>
                  
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problemerkl&auml;rung</b><br>
                           
                  <p>
                       Es gibt viele Situationen, in denen durch schlechte Farbauswahl seitens des Designers die Aufnahme und das Verst&auml;ndnis der
                     Informationen auf einer Seite erschwert werden.
                     
                  </p>
                           
                  <p>
                       Hierzu z&auml;hlen unter Umst&auml;nden Faktoren wie die folgenden:
                     
                  </p>
                           
                  <ul>
                                 
                     <li> Ung&uuml;nstige Auswahl von Vordergrund- und Hintergrundfarbe.</li>
                                 
                     <li> Der Benutzer zeigt die Seite auf einem Bildschirm an, der die Farben nicht mit derselben Qualit&auml;t darstellen kann wie der
                        Bildschirm des Designers.
                     </li>
                                 
                     <li> Der Benutzer zeigt die Seite auf einem PDA oder Mobiltelefon mit einem Schwarzwei&szlig;bildschirm an.</li>
                                 
                     <li> Der Benutzer muss die Seite auf einem Schwarzwei&szlig;drucker drucken.</li>
                                 
                     <li> Der Benutzer ist farbenblind.</li>
                              
                  </ul>
                  
                  
                  <p>
                     Auszug aus den W3C-Richtlinien:
                     
                  </p>
                  
                  
                  <p>
                     <strong>Richtlinie Nr. 2. Verlassen Sie sich nicht nur auf Farben. <br> Sorgen Sie auf jeden Fall daf&uuml;r, dass Texte und Grafiken auch ohne Farben erkennbar bleiben.</strong>
                     
                  </p>
                  
                  <p>
                     Wenn die Informationsweitergabe allein aufgrund von Farbunterschieden erfolgt, dann k&ouml;nnen Benutzer mit Fehlsichtigkeit bei
                     Farben bzw. mit Ausgabeger&auml;ten, die entweder keine Farben oder &uuml;berhaupt nichts grafisch darstellen k&ouml;nnen, diese Information
                     nicht erkennen. Falls sich Vordergrund- und Hintergrundfarbe im Farbton zu &auml;hnlich sind, bieten sie auf einem Monochrom-Bildschirm
                     bzw. f&uuml;r Benutzer mit Farbfehlsichtigkeit unter Umst&auml;nden keinen ausreichenden Kontrast.
                     
                  </p>
                  
                        
               </td>
            </tr>
         </table>
      </div>
   </body>
</html>