<html xmlns:un="http://usablenet.com/namespaces/508_rules">
   <link rel="stylesheet" href="josh.css">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Detailanzeige f&uuml;r Regel: Markups f&uuml;r Zitate nicht f&uuml;r Formatierungseffekte verwenden</title>
      <!--
  508/W3C Accessibility Suite OEM V2 for Macromedia Dreamweaver
  (C) Copyright 2001-2005 UsableNet Inc. All rights reserved.
  -->
   </head>
   <body bgcolor="#ffffff">
      <div id="Beschreibung">
         <table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
            <tr>
               <td valign="top" nowrap="true" class="name">Markups f&uuml;r Zitate nicht f&uuml;r Formatierungseffekte verwenden</td>
               <td valign="top" nowrap="true" class="compatibility">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="divider"><img src="dwres:18084" width="100%" height="1"></td>
            </tr>
            <tr>
               <td valign="top" align="right" nowrap="true" colspan="2" class="requirements">WAI / WCAG 1.0 Priorit&auml;t 2 Checkpunkt 3.7</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problembeschreibung</b><br>
                  
                           
                  <p>
                     Die Seite enth&auml;lt mit BLOCKQUOTE bzw. Q codierten Text. Falls dieser Text kein Zitat ist, sollte der HTML-Code ge&auml;ndert werden.
                     	 
                  </p>
                      
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>&Uuml;berpr&uuml;fung</b>
                  
                           
                  <p>
                     &uuml;berpr&uuml;fen Sie, ob der im Element BLOCKQUOTE (bzw. Q) enthaltene Text tats&auml;chlich ein Zitat ist. 	 
                     	 
                  </p>
                  
                  <p>
                     Ist dies nicht der Fall, entfernen Sie ggf. das Tag BLOCKQUOTE (bzw. Q) und ersetzen es durch ein DIV (oder SPAN)-Tag, das
                     auf eine CSS-Klasse verweist, mit der Sie die Formatierungseigenschaften von BLOCKQUOTE (bzw. Q) darstellen k&ouml;nnen.
                     
                  </p>
                  
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problemerkl&auml;rung</b><br>
                  
                  
                  <p>
                     Die falsche Verwendung dieser Tags (n&auml;mlich zum Erzielen von Formatierungseffekten) behindert die Zug&auml;nglichkeit. St&ouml;&szlig;t n&auml;mlich
                     ein Bildschirmleseger&auml;t oder ein lesender Browser auf diesen f&auml;lschlich codierten Text, &auml;ndert sich dessen Stimme bzw. die
                     Tonlage, um dem Zuh&ouml;rer diese Textstelle als Zitat deutlich zu machen (also als Verweis auf einen Kommentar anderer Quelle).
                     
                  </p>
                  
                  
                  <p>
                     Dieser Zuh&ouml;rer w&auml;re verwirrt, wenn es sich bei einem "Zitat" dann tats&auml;chlich um den eigentlichen Inhalt der Seite handelte,
                     die nur aus Gr&uuml;nden der Formatierung mit BLOCKQUOTE oder Q codiert wurde.
                     
                  </p>
                        
               </td>
            </tr>
         </table>
      </div>
   </body>
</html>