<html xmlns:un="http://usablenet.com/namespaces/508_rules">
   <link rel="stylesheet" href="josh.css">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Detailanzeige f&uuml;r Regel: Hyperlinkbezeichnungen nicht mehrfach verwenden, wenn die Hyperlinks auf unterschiedliche URLs verweisen</title>
      <!--
  508/W3C Accessibility Suite OEM V2 for Macromedia Dreamweaver
  (C) Copyright 2001-2005 UsableNet Inc. All rights reserved.
  -->
   </head>
   <body bgcolor="#ffffff">
      <div id="Beschreibung">
         <table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
            <tr>
               <td valign="top" nowrap="true" class="name">Hyperlinkbezeichnungen nicht mehrfach verwenden, wenn die Hyperlinks auf unterschiedliche URLs verweisen</td>
               <td valign="top" nowrap="true" class="compatibility">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="divider"><img src="dwres:18084" width="100%" height="1"></td>
            </tr>
            <tr>
               <td valign="top" align="right" nowrap="true" colspan="2" class="requirements">WAI / WCAG 1.0 Priorit&auml;t 2 Checkpunkt 13.1</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problembeschreibung</b><br>
                  
                  
                  <p>
                     Die Seite enth&auml;lt mindestens zwei Hyperlinks mit der gleichen Bezeichnung, die auf unterschiedliche URLs verweisen.
                     
                  </p>
                  
                  
                  <p>
                     Eine Hyperlinkbezeichnung ist der Textteil des Hyperlinkinhalts und des Hyperlinktitels. Also der gesamte Text zwischen den
                     Tags A und /A, einschlie&szlig;lich der ALTs von Grafiken sowie ggf. der Inhalt des Attributes TITLE.
                     
                  </p>
                  
                      
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Probleml&ouml;sung</b>
                  
                  
                  <p>
                     Versuchen Sie daher immer, f&uuml;r zu unterschiedlichen Zielen f&uuml;hrende Hyperlinks auch unterschiedliche Bezeichnungen zu verwenden.
                     Au&szlig;erdem sollten Sie immer aussagekr&auml;ftige Bezeichnungen einf&uuml;gen.<br> Sofern dies nicht m&ouml;glich ist (wenn beispielsweise f&uuml;r mehrere Produkte auf einer Seite der gleiche Hyperlink verwendet wird),
                     sollten Sie die Hyperlinks durch unterschiedliche Werte f&uuml;r das Attribut TITLE des A-Elements unterscheiden.
                     
                  </p>
                      
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problemerkl&auml;rung</b><br>
                           
                  <p>
                     Verwenden Sie Hyperlinkbezeichnungen nicht mehrfach, wenn die Hyperlinks auf unterschiedliche URLs verweisen.  Wenn auf einer
                     Seite mehrere Hyperlinks mit dem gleichen Text vorhanden sind, dann sollten alle diese Hyperlinks auch auf die gleiche Quelle
                     verweisen. Eine solche Konsisitenz unterst&uuml;tzt sowohl das Seitendesign als auch die Zug&auml;nglichkeit.
                     
                     	 
                  </p>
                  
                  <p>
                     Tritt eine Hyperlinkbezeichnung wiederholt auf, ist dies ein Hinweis darauf, dass der Hyperlink zum gleichen Ziel f&uuml;hrt. Ist
                     dies nicht der Fall, sind die Benutzer unter Umst&auml;nden &uuml;berrascht und verwirrt. Am Besten sollte man nicht davon ausgehen,
                     dass viele Benutzer &uuml;berhaupt mit der Funktionsweise von Websites vertraut sind. Hierin liegt ein erhebliches Risiko, dass
                     sie leicht die Orientierung verlieren und die Site ggf. verlassen.
                     
                  </p>
                  
                  
                  <p>
                     Au&szlig;erdem lassen Bildschirmleseger&auml;te und lesende Browser h&auml;ufig die M&ouml;glichkeit zu, dass die Benutzer eine Liste der auf der
                     Seite enthaltenen Hyperlinks in einem eigenen Pop-Up-Fenster &ouml;ffnen k&ouml;nnen. Dabei wird jeder Hyperlink au&szlig;erhalb seines Kontextes
                     angezeigt. Wenn dann zwei Hyperlinks die gleiche Bezeichnung tragen, wird der Benutzer davon ausgehen, dass sie auch zum gleichen
                     Ziel f&uuml;hren. Er kann dann eine bestimmte Seite bzw. einen bestimmten Online-Dienst unter Umst&auml;nden nicht erreichen.
                     
                  </p>
                      
               </td>
            </tr>
         </table>
      </div>
   </body>
</html>