<html xmlns:un="http://usablenet.com/namespaces/508_rules">
   <link rel="stylesheet" href="josh.css">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Detailanzeige f&uuml;r Regel: &uuml;berschriften-Elemente verwenden</title>
      <!--
  508/W3C Accessibility Suite OEM V2 for Macromedia Dreamweaver
  (C) Copyright 2001-2005 UsableNet Inc. All rights reserved.
  -->
   </head>
   <body bgcolor="#ffffff">
      <div id="Beschreibung">
         <table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
            <tr>
               <td valign="top" nowrap="true" class="name">&uuml;berschriften-Elemente verwenden</td>
               <td valign="top" nowrap="true" class="compatibility">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="divider"><img src="dwres:18084" width="100%" height="1"></td>
            </tr>
            <tr>
               <td valign="top" align="right" nowrap="true" colspan="2" class="requirements">WAI / WCAG 1.0 Priorit&auml;t 2 Checkpunkt 3.5</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problembeschreibung</b><br>
                  
                           
                  <p>
                     Die Seite enth&auml;lt keine &uuml;berschriften-Elemente (H1, H2, ... bis H7).
                     	 
                  </p>
                  
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Probleml&ouml;sung</b>
                  
                           
                  <p>
                     F&uuml;gen Sie mindestens ein &uuml;berschriften-Element in ein Dokument ein. Beachten Sie die hierarchischen Ebenen: Springen Sie also
                     von H1 zu H2 und vermeiden Sie das &uuml;berspringen von Ebenen (von H1 direkt auf H3 etc.).
                     	 
                  </p>
                      
                  
                  <p>
                     Ein schnell durchgef&uuml;hrter Test um festzustellen, welche &uuml;berschriften erforderlich sind und welche nicht, besteht darin,
                     eine Gliederung des Inhalts einer Seite zu erstellen. Beginnen Sie bei einer bestimmten Ebene (z. B. bei H3) und kennzeichnen
                     Sie alle folgenden Abschnitte, die ebenfalls mit dieser &uuml;berschrift (H3) versehen sind. Falls Sie in der Gliederung zu einem
                     detaillierteren Abschnitt gelangen, verwenden Sie ggf. eine untergeordnete &uuml;berschriftenstufe (wie z. B. H4).
                     
                  </p>
                  
                  <p>
                     Falls Sie die Standardformatierung der &uuml;berschriften nicht gebrauchen k&ouml;nnen, definieren Sie eine CSS-Klasse mit den gew&uuml;nschten
                     Eigenschaften und verwenden diese als &uuml;berschrift.
                     
                  </p>
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problemerkl&auml;rung</b><br>
                  
                           
                  <p>
                     Erstellen Sie mithilfe der HTML-&uuml;berschriften (H1, H2, ... bis H7) eine hierarchische Struktur der verschiedenen inhaltlichen
                     Abschnitte der Seite.
                     	 
                  </p>
                  
                  <p>
                     Auf diese Weise k&ouml;nnen die Besucher einer Website eine Gliederung des Dokuments anzeigen und ohne den ganzen Text lesen zu
                     m&uuml;ssen erkennen, welche Teile f&uuml;r sie wirklich interessant sind.
                     
                  </p>
                  
                  <p>
                     Au&szlig;erdem ist es mit verschiedenen lesenden Browsern bzw. Bildschirmlesern m&ouml;glich, eine Liste aller &uuml;berschriften eines Dokuments
                     zu erhalten und sofort zu einer bestimmten &uuml;berschrift zu springen. Dies ist besonders f&uuml;r solche Benutzer von Vorteil, die
                     das Dokument gar nicht sehen k&ouml;nnen, weil sie beispielsweise nur eingeschr&auml;nkt sehf&auml;hig oder ganz blind sind oder die Seite
                     &uuml;ber einen Telefondienst aufgerufen haben. Auf diese Weise braucht der Benutzer sich nicht den ganzen Text vorlesen zu lassen
                     sondern kann sofort zu dem Teil springen, der ihn am meisten interessiert.
                     
                  </p>
                  
                        
               </td>
            </tr>
         </table>
      </div>
   </body>
</html>