<html xmlns:un="http://usablenet.com/namespaces/508_rules">
   <link rel="stylesheet" href="josh.css">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   
      <title>Detailanzeige f&uuml;r Regel: Aussagekr&auml;ftige Bezeichnungen f&uuml;r Hyperlinks verwenden</title>
      <!--
  508/W3C Accessibility Suite OEM V2 for Macromedia Dreamweaver
  (C) Copyright 2001-2005 UsableNet Inc. All rights reserved.
  -->
   </head>
   <body bgcolor="#ffffff">
      <div id="Beschreibung">
         <table cellpadding="0" cellspacing="0" border="0" width="100%" class="main">
            <tr>
               <td valign="top" nowrap="true" class="name">Aussagekr&auml;ftige Bezeichnungen f&uuml;r Hyperlinks verwenden</td>
               <td valign="top" nowrap="true" class="compatibility">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="divider"><img src="dwres:18084" width="100%" height="1"></td>
            </tr>
            <tr>
               <td valign="top" align="right" nowrap="true" colspan="2" class="requirements">WAI / WCAG 1.0 Priorit&auml;t 2 Checkpunkt 13.1</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problembeschreibung</b><br>
                  
                           
                  <p>
                     Die Seite enth&auml;lt Hyperlinks, deren Bezeichnung (also der Inhalt des A-Elements) bzw. Title (Attribut TITLE von A) nicht ausreichend
                     informativ erscheint. Stellen Sie sicher, dass diese Beschriftungen sinnvoll, informativ und kurz sind. 
                     
                  </p>
                  
                  
                  <p> Die Texte von Hyperlinks sollten so sinnvoll sein, dass sie auch au&szlig;erhalb ihres Kontextes einen Sinn ergeben, und zwar entweder
                     f&uuml;r sich genommen oder im Zusammenhang mit anderen umgebenden Hyperlinks. Diese Hyperlinktexte sollten aber auch knapp formuliert
                     sein. So sollten Sie in HTML beispielsweise Beschriftungen einf&uuml;gen wie "Informationen zu Version 4.3" anstatt "Klicken Sie
                     hier", "Info" usw. Neben einem eindeutigen Hyperlinktext sollten die Content-Entwickler das Ziel des Hyperlinks aber auch
                     durch einen bedeutungsvollen Titel darstellen (z. B. in HTML durch das Attribut TITLE).
                     	 
                  </p>
                  
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Probleml&ouml;sung</b>
                  
                  
                  <p>
                     Bearbeiten Sie die Beschriftungen s&auml;mtlicher Hyperlinks, so dass klar ersichtlich ist, wohin der Hyperlink f&uuml;hrt. Diese Beschreibung
                     sollte kurz und auch au&szlig;erhalb des Kontextes (d. h. in einer Liste aller Hyperlinks einer Seite) so weit wie m&ouml;glich zu verstehen
                     sein.
                     
                  </p>
                  
                  <p>
                     Falls die Hyperlinkbeschreibung nicht ausreicht kann auch der Titel des Hyperlinks verwendet werden (der von vielen Browsern
                     in einem kleinen vor&uuml;bergehend angezeigten Fenster als QuickInfo eingeblendet wird, sobald der Mauszeiger &uuml;ber den Hyperlink
                     f&auml;hrt). Wenn Hyperlinktitel verwendet werden, dann sollten sie f&uuml;r alle Hyperlinks der Seite konsistent sein.
                     
                  </p>
                  
                        
               </td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td colspan="2" class="clearseparation">&nbsp;</td>
            </tr>
            <tr>
               <td valign="top" colspan="2" class="description"><b>Problemerkl&auml;rung</b><br>
                           
                  <p>
                     Die meisten assistiven Technologien k&ouml;nnen s&auml;mtliche Hyperlinks einer Seite zusammenfassen und sie als eigene Liste darstellen.
                     In solchen F&auml;llen m&uuml;ssen die Benutzer aus den in der Hyperlinkbeschriftung (also den Inhalten) und dem Titel-Attribut enthaltenen
                     Informationen erkennen k&ouml;nnen, wohin diese Hyperlinks f&uuml;hren.
                     	 
                  </p>
                  
                  <p>
                     Aus diesem Grund sind Hyperlinks wie "Weitere Informationen", besonders wenn diese auf einer Seite mehr als einmal vorhanden
                     sind, nicht aussagekr&auml;ftig genug, sobald sie aus dem Kontext genommen werden. 
                     
                  </p>
                  
                  
                  <p>
                     Bedenken Sie auch, dass diese Hyperlinkbeschriftungen so viel Informationen wie n&ouml;tig enthalten sollten, damit ein Benutzer
                     erschlie&szlig;en kann, wohin der betreffende Hyperlink f&uuml;hrt. Der Benutzer sollte bereits <strong>vor</strong> dem Klicken auf einen Hyperlink genau wissen, wohin dieser Hyperlink f&uuml;hrt. Andernfalls muss dieser Benutzer warten, bis
                     die neue Seite geladen und angezeigt wird, um sie dann m&uuml;hsam zu lesen und festzustellen, dass es nicht die gew&uuml;nschte Seite
                     ist.
                     
                  </p>
                  
                  <p>
                     Dies ist besonders dann wichtig, wenn ein Hyperlink zu einer sehr umfangreichen Seite f&uuml;hrt (um den Benutzer vorzuwarnen,
                     dass die Antwortzeit unter Umst&auml;nden l&auml;nger ist) bzw. zu Seiten, f&uuml;r die ein besonderes Plug-In erforderlich ist (wie z. B.
                     f&uuml;r PDF-, Flash- oder MS Word-Dateien usw.).
                     
                  </p>
                  
                        
               </td>
            </tr>
         </table>
      </div>
   </body>
</html>